//******************************************************************************
//******************************************************************************
//**                                                                          **
//** Copyright(C) 2020-2021, XCradle Electronic Information Industry Co., Ltd. **
//**                                                                          **
//**                          All Rights Reserved.                            **
//**                                                                          **
//******************************************************************************
//******************************************************************************

//******************************************************************************
// [File] XCradleChsNetworkStackSetupScreen.uni
// [Description] Add XCradle Chinese STR define in this file
// [Author] JSY-ZZP
// [Date] 2021/02/25
//******************************************************************************
/=#
#langdef   x-AMI "x-AMI"
#langdef   en-US "English"
#langdef   zh-chs "中文 (简体)"

#string STR_NETWORK_STACK_ENABLE        #language zh-chs "网络堆栈"
#string STR_NETWORK_STACK_HELP          #language zh-chs "启用/禁用 UEFI网络堆栈"
#string STR_STACK_FORM                  #language zh-chs "网络堆栈配置"
#string STR_STACK_FORM_HELP             #language zh-chs "设置网络堆栈"
#string STR_IPV4_PXE_ENABLE             #language zh-chs "Ipv4 PXE支持"
#string STR_IPV4_PXE_HELP               #language zh-chs "启用/禁用Ipv4 PXE 启动支持。如果禁用该选项，则不会创建Ipv4 PXE启动选项。"
#string STR_IPV6_PXE_ENABLE             #language zh-chs "Ipv6 PXE 支持"
#string STR_IPV6_PXE_HELP               #language zh-chs "启用/禁用Ipv6 PXE 启动支持。如果关闭该选项，则不会创建Ipv6 PXE启动选项"
#string STR_IPSEC_CERTIFICATE_ENABLE    #language zh-chs "IPSEC 认证"
#string STR_IPSEC_CERTIFICATE_HELP      #language zh-chs "启用 IPSEC 认证"
#string STR_PXE_BOOT_WAIT_TIME          #language zh-chs "PXE 启动等待时间"
#string STR_PXE_BOOT_WAIT_TIME_HELP     #language zh-chs "等待（0-5）秒 按ESC键取消PXE启动，采用+/-或者数字键设置值。"
#string STR_MEDIA_DETECT_COUNT          #language zh-chs "媒介检测次数"
#string STR_MEDIA_DETECT_COUNT_HELP     #language zh-chs "启动媒介存在的次数将会被检测。采用+/-或者数字键设置值，范围：1-50。"
#string STR_IPV4_HTTP_ENABLE            #language zh-chs "Ipv4 HTTP支持"
#string STR_IPV4_HTTP_HELP              #language zh-chs "启用/禁用Ipv4 HTTP启动支持。如果禁用该选项，则不会创建Ipv4 HTTP启动选项。"
#string STR_IPV6_HTTP_ENABLE            #language zh-chs "Ipv6 HTTP支持"
#string STR_IPV6_HTTP_HELP              #language zh-chs "启用/禁用Ipv6 HTTP启动支持。如果禁用该选项，则不会创建Ipv6 HTTP启动选项。"

//******************************************************************************
//******************************************************************************
//**                                                                          **
//** Copyright(C) 2020-2021, XCradle Electronic Information Industry Co., Ltd. **
//**                                                                          **
//**                          All Rights Reserved.                            **
//**                                                                          **
//******************************************************************************
//******************************************************************************